app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `created_at`, `updated_at`) VALUES ('asdas', 'asdas', '2015-07-23 11:55:17', '2015-07-23 11:55:17')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 1
---
  def destroy
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE ((   posts.title LIKE '%d%'))
---
    def set_post
      @post = Post.find(params[:id])