app/controllers/products_controller.rb

INSERT INTO `products` (`name`, `price`, `category`, `released_on`, `created_at`, `updated_at`) VALUES ('dfxdf', 20, 'zsd', '2015-07-28', '2015-07-28 07:06:02', '2015-07-28 07:06:02')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])